In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

ê²°ì¸¡ì¹˜ ìžˆëŠ” ì¹¼ëŸ¼ ì œì™¸  
one-hot encoding í•  ì¹¼ëŸ¼ë“¤  
pclass, sex, sibsp, class, who, adult_male, alive, alone

In [10]:
import pandas as pd
dfx = pd.get_dummies(df[['pclass', 'sex', 'sibsp', 'class', 'who', 'adult_male', 'alive', 'alone']])
dfx.shape

(891, 22)

In [9]:
df = pd.concat([df,dfx],axis=1)
df.shape

(891, 43)

In [11]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'pclass', 'sibsp', 'adult_male', 'alone',
       'sex_female', 'sex_male', 'class_First', 'class_Second', 'class_Third',
       'who_child', 'who_man', 'who_woman', 'alive_no', 'alive_yes', 'pclass',
       'sibsp', 'adult_male', 'alone', 'sex_female', 'sex_male', 'class_First',
       'class_Second', 'class_Third', 'who_child', 'who_man', 'who_woman',
       'alive_no', 'alive_yes'],
      dtype='object')

In [15]:
X = df[['sex_female', 'sex_male', 'class_First', 'class_Second', 'class_Third',
       'who_child', 'who_man', 'who_woman', 'alive_no', 'alive_yes', 'pclass',
       'sibsp', 'adult_male', 'alone', 'sex_female', 'sex_male', 'class_First',
       'class_Second', 'class_Third', 'who_child', 'who_man', 'who_woman',
       'alive_no', 'alive_yes','fare']]
Y = df[['survived']]
X.shape, Y.shape

((891, 53), (891, 1))

In [16]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)
X = scaler.transform(X)
X.shape

(891, 53)

In [17]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X,Y)

In [18]:
from sklearn.linear_model import LogisticRegression
logR = LogisticRegression()
logR.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [19]:
logR.score(x_train, y_train)

1.0